renesas/amazon-freertos/projects/renesas/rx65n-cloud-kit-uart-sx-ulpgn/e2studio-gcc/aws_demos/application_code/renesas_demo_data_uploader.c
#define DemoCONN_RETRY_LIMIT              ( 100 )

#define DemoKEEPALIVE_SECONDS             ( 1200 )

#define myappONE_SECOND_DELAY_IN_TICKS    pdMS_TO_TICKS( 1000UL )

#define DemoNETWORK_TYPES                 ( AWSIOT_NETWORK_TYPE_ALL )

/**
 * @brief The keep-alive interval used for this demo.
 *
 * An MQTT ping request will be sent periodically at this interval.
 */
#define KEEP_ALIVE_SECONDS    ( 60 )

/**
 * @brief The timeout for Shadow and MQTT operations in this demo.
 */
#define TIMEOUT_MS            ( 5000 )

/**
 * @brief Format string representing a Shadow document with a "desired" state.
 *
 * Note the client token, which is required for all Shadow updates. The client
 * token must be unique at any given time, but may be reused once the update is
 * completed. For this demo, a timestamp is used for a client token.
 */
#define SHADOW_DESIRED_JSON     \
    "{"                         \
    "\"state\":{"               \
    "\"desired\":{"             \
    "\"SensorDataUpdateOn\":%01d"          \
    "}"                         \
    "},"                        \
    "\"clientToken\":\"%06lu\"" \
    "}"

/**
 * @brief The expected size of #SHADOW_DESIRED_JSON.
 *
 * Because all the format specifiers in #SHADOW_DESIRED_JSON include a length,
 * its full size is known at compile-time.
 */
#define EXPECTED_DESIRED_JSON_SIZE    ( sizeof( SHADOW_DESIRED_JSON ) - 3 )

/**
 * @brief Format string representing a Shadow document with a "reported" state.
 *
 * Note the client token, which is required for all Shadow updates. The client
 * token must be unique at any given time, but may be reused once the update is
 * completed. For this demo, a timestamp is used for a client token.
 */
#define SHADOW_REPORTED_JSON    \
    "{"                         \
    "\"state\":{"               \
    "\"reported\":{"            \
    "\"SensorDataUpdateOn\":%01d"          \
    "}"                         \
    "},"                        \
    "\"clientToken\":\"%06lu\"" \
    "}"

/**
 * @brief The expected size of #SHADOW_REPORTED_JSON.
 *
 * Because all the format specifiers in #SHADOW_REPORTED_JSON include a length,
 * its full size is known at compile-time.
 */
#define EXPECTED_REPORTED_JSON_SIZE    ( sizeof( SHADOW_REPORTED_JSON ) - 3 )

/* LEDControl status pattern */
#define LED_COMMAND_ON      "LED_ON"
#define LED_COMMAND_LIGHT   "LED_LIGHT"
#define LED_COMMAND_TEMP    "LED_TEMP"
#define LED_COMMAND_OFF     "LED_OFF"

/* SWVersion status pattern */
#define SET_COMMAND_VER     "VER_"

/* SensorDataUpdateOn status pattern */
#define SNS_COMMAND_ON		"UpdateOn"
#define SNS_COMMAND_OFF		"UpdateOff"

/* SWVersion & IPAddress PUBLISH */
#define SHADOW_VER_IP_LIST_JSON  \
    "{"                          \
    "\"SWVersion\": \"%d.%d.%d\","  \
    "\"IPAddress\": \"%d.%d.%d.%d\""\
    "}"

static BaseType_t prxCreateNetworkConnection( void );
static IotNetworkError_t prvNetworkDisconnectCallback( void * pvContext );
static void prvNetworkStateChangeCallback( uint32_t ulNetworkType,
                                           AwsIotNetworkState_t xNetworkState,
                                           void * pvContext );

/**
 * @brief Structure which holds the context for an MQTT connection within Demo.
 */
static MqttConnectionContext_t xConnection =
{
    .pvNetworkConnection = NULL,
    .ulNetworkType       = AWSIOT_NETWORK_TYPE_NONE,
    .xNetworkInfo        = IOT_MQTT_NETWORK_INFO_INITIALIZER,
    .xMqttConnection     = IOT_MQTT_CONNECTION_INITIALIZER,
    .xDisconnectCallback = prvNetworkDisconnectCallback
};

/**
 * @brief Network manager subscription callback.
 */

static IotNetworkManagerSubscription_t xSubscriptionHandle = IOT_NETWORK_MANAGER_SUBSCRIPTION_INITIALIZER;

/**
 * @brief Semaphore to indicate a new network is available.
 */
static SemaphoreHandle_t xNetworkAvailableLock = NULL;

/**
 * @brief Flag used to unset, during disconnection of currently connected network. This will
 * trigger a reconnection from the main MQTT task.
 */
static BaseType_t xNetworkConnected = pdFALSE;

int32_t sensorupdatecurrentState = 1;
int32_t ledcurrentState = 0;
int32_t blinkCnt = 0;
wifi_ip_configuration_t ip_cfg;

/*-----------------------------------------------------------*/

/* Declaration of demo function. */
int RenesasSensorDataUploadDemo( bool awsIotMqttMode,
                 const char * pIdentifier,
                 void * pNetworkServerInfo,
                 void * pNetworkCredentialInfo,
                 const IotNetworkInterface_t * pNetworkInterface );

/*-----------------------------------------------------------*/
static void turn_on_led (void)
{
    st_sensors_t data;

    if (blinkCnt > 0) {
        PORTB.PDR.BIT.B0 ^= 1;
        PORTB.PDR.BIT.B2 ^= 1;
        blinkCnt--;
    }
    else {
	    R_READ_Sensors(&data);
	    switch(ledcurrentState) {
	    case 2:
	        PORTB.PDR.BIT.B0 = 1;
	        PORTB.PDR.BIT.B2 = 1;
	        break;
	    case 3:
	        PORTB.PDR.BIT.B0 = 0;
	        PORTB.PDR.BIT.B2 = 0;
	        break;
	    case 4:
	        if (data.als >= 500) {
	            PORTB.PDR.BIT.B0 = 0;
	            PORTB.PDR.BIT.B2 = 0;
	        }
	        else if (data.als >= 100) {
	            PORTB.PDR.BIT.B0 = 1;
	            PORTB.PDR.BIT.B2 = 0;
	        }
	        else {
	            PORTB.PDR.BIT.B0 = 1;
	            PORTB.PDR.BIT.B2 = 1;
	        }
	        break;
	    case 5:
			data.temperature = (data.temperature - 32) / 1.8;
	        if (data.temperature <= 30) {
	            PORTB.PDR.BIT.B0 = 0;
	            PORTB.PDR.BIT.B2 = 0;
	        }
	        else if (data.temperature <= 40) {
	            PORTB.PDR.BIT.B0 = 1;
	            PORTB.PDR.BIT.B2 = 0;
	        }
	        else {
	            PORTB.PDR.BIT.B0 = 1;
	            PORTB.PDR.BIT.B2 = 1;
	        }
	        break;
	    default:
	        break;
	    }
    }
}

static IotMqttError_t mpttAckCallBack (void)
{
    IotMqttError_t status;
    int acknowledgementLength = 0;
    char pAcknowledgementMessage[ renesasDemoBUFFER_LENGTH ] = { 0 };
    IotMqttPublishInfo_t acknowledgementInfo = IOT_MQTT_PUBLISH_INFO_INITIALIZER;
    char ipAddess[4] = {0,0,0,0};

    /* divide IP adress. */
    ipAddess[0] = (char)((ip_cfg.ipaddress >> 24) & 0x000000FF);
    ipAddess[1] = (char)((ip_cfg.ipaddress >> 16) & 0x000000FF);
    ipAddess[2] = (char)((ip_cfg.ipaddress >> 8 ) & 0x000000FF);
    ipAddess[3] = (char)((ip_cfg.ipaddress      ) & 0x000000FF);

