renesas/amazon-freertos/projects/renesas/rx65n-cloud-kit-uart-sx-ulpgn/e2studio-gcc/aws_demos/application_code/renesas_demo_data_uploader.c
	/* LEDControl */
    /* Check if there is a different "LEDControl" state in the Shadow. */
    deltaFound = _getDelta( pCallbackParam->u.callback.pDocument,
                            pCallbackParam->u.callback.documentLength,
                            "LEDControl",
                            &pDelta,
                            &deltaLength );

    if( deltaFound == true )
    {
        /* Change the current state based on the value in the delta document. */
        if( *pDelta == '"' )
        {
            for( i = 0; i < ( deltaLength - 2 ) ; i++ ) 
            {
                cmdBuff[i] = *(pDelta + i + 1);
            }

            if( 0 == strcmp(cmdBuff,LED_COMMAND_ON))
            {
                IotLogInfo( "%.*s changing state from %d to 2.",
                            pCallbackParam->thingNameLength,
                            pCallbackParam->pThingName,
                            currentState );

                currentState = 2;
                ledcurrentState = currentState;
            }
            else if( 0 == strcmp(cmdBuff,LED_COMMAND_OFF))
            {
                IotLogInfo( "%.*s changing state from %d to 3.",
                            pCallbackParam->thingNameLength,
                            pCallbackParam->pThingName,
                            currentState );

                currentState = 3;
                ledcurrentState = currentState;
            }
            else if( 0 == strcmp(cmdBuff,LED_COMMAND_LIGHT))
            {
                IotLogInfo( "%.*s changing state from %d to 4.",
                            pCallbackParam->thingNameLength,
                            pCallbackParam->pThingName,
                            currentState );

                currentState = 4;
                ledcurrentState = currentState;
            }
            else if( 0 == strcmp(cmdBuff,LED_COMMAND_TEMP))
            {
                IotLogInfo( "%.*s changing state from %d to 5.",
                            pCallbackParam->thingNameLength,
                            pCallbackParam->pThingName,
                            currentState );

                currentState = 5;
                ledcurrentState = currentState;
            }
            else
            {
                IotLogWarn( "Unknown LEDControl state parsed from delta document." );
            }
        }
        else
        {
            IotLogWarn( "Unknown LEDControl state parsed from delta document." );
        }
    }
    else{
        IotLogWarn( "Failed to parse LEDControl state from delta document." );
    }

	/* SWVersion */
    /* Check if there is a different "SWVersion" state in the Shadow. */
    deltaFound = _getDelta( pCallbackParam->u.callback.pDocument,
                            pCallbackParam->u.callback.documentLength,
                            "SWVersion",
                            &pDelta,
                            &deltaLength );

    if( deltaFound == true )
    {
        /* Change the current state based on the value in the delta document. */
        if( *pDelta == '"' )
        {
            for( i = 0; i < 16 ; i++ ) 
            {
                cmdBuff[i] = '\0';
            }
            for( i = 0; i < ( deltaLength - 2 ) ; i++ ) 
            {
                cmdBuff[i] = *(pDelta + i + 1);
            }

            if( 0 == strncmp(cmdBuff,SET_COMMAND_VER,4))
            {
                if( ( *(pDelta + staIdx) >= '0' ) && ( *(pDelta + staIdx) <= '9' ) )
                {
                    i = staIdx;
                    while( (   *(pDelta + i) != '.' ) &&
                           ( ( *(pDelta + i) >= '0' ) && ( *(pDelta + i) <= '9' ) ) ){
                        i++;
                    }
                    if ( *( pDelta + i ) == '.' ){
                        endIdx = i;
                        for(i = staIdx ; i < endIdx ;i++){
                            num = ( (*( pDelta + i )) - 0x30 );
                            for(j = 0; j < (endIdx - i - 1) ;j++){
                                num *= 10;
                            }
                            swVer[0] += num;
                            num = 0;
                        }
                    	staIdx = endIdx + 1;
	                    i = staIdx;
	                    while( (   *(pDelta + i) != '.' ) &&
	                           ( ( *(pDelta + i) >= '0' ) && ( *(pDelta + i) <= '9' ) ) ){
	                        i++;
	                    }
	                    if ( *( pDelta + i ) == '.' ){
	                        endIdx = i;
	                        for(i = staIdx ; i < endIdx ;i++){
	                            num = ( (*( pDelta + i )) - 0x30 );
	                            for(j = 0; j < (endIdx - i - 1) ;j++){
	                                num *= 10;
	                            }
	                            swVer[1] += num;
                                num = 0;
	                        }
		                    staIdx = endIdx + 1;
		                    i = staIdx;
		                    while( (   *(pDelta + i) != '"' ) &&
		                           ( ( *(pDelta + i) >= '0' ) && ( *(pDelta + i) <= '9' ) ) ){
		                        i++;
		                    }
		                    if ( *( pDelta + i ) == '"' ){
		                        endIdx = i;
		                        for(i = staIdx ; i < endIdx ;i++){
		                            num = ( (*( pDelta + i )) - 0x30 );
		                            for(j = 0; j < (endIdx - i - 1) ;j++){
		                                num *= 10;
		                            }
		                            swVer[2] += num;
                                    num = 0;
                                    swVerFix = true;
		                        }
		                    }
	                    }
                    }

                    if(swVerFix){
                        if( ( (xAppFirmwareVersion.u.x.ucMajor != swVer[0])   || 
                              (xAppFirmwareVersion.u.x.ucMinor != swVer[1]) ) ||
                              (xAppFirmwareVersion.u.x.usBuild != swVer[2]) ) {
                            xAppFirmwareVersion.u.x.ucMajor = swVer[0];
                            xAppFirmwareVersion.u.x.ucMinor = swVer[1];
                            xAppFirmwareVersion.u.x.usBuild = swVer[2];
                            blinkCnt = 10;
                        }
                    }
                    else{
                        IotLogWarn( "Failed to parse SWVersion state from delta document." );
                    }
                }
                else
                {
                    IotLogWarn( "Failed to parse SWVersion state from delta document." );
                }
            }
            else
            {
                IotLogWarn( "Unknown SWVersion state parsed from delta document." );
            }
        }
        else
        {
            IotLogWarn( "Unknown SWVersion state parsed from delta document." );
        }
    }
    else{
        IotLogWarn( "Failed to parse SWVersion state from delta document." );
    }

	/* SensorDataUpdateOn */
    /* Check if there is a different "SensorDataUpdateOn" state in the Shadow. */
    deltaFound = _getDelta( pCallbackParam->u.callback.pDocument,
                            pCallbackParam->u.callback.documentLength,
                            "SensorDataUpdateOn",
                            &pDelta,
                            &deltaLength );

