renesas/amazon-freertos/projects/renesas/rx65n-cloud-kit-uart-sx-ulpgn/e2studio-gcc/aws_demos/application_code/renesas_demo_data_uploader.c
    /* Set the common members of the Shadow update document info. */
    updateDocument.pThingName = pThingName;
    updateDocument.thingNameLength = thingNameLength;
    updateDocument.u.update.pUpdateDocument = pUpdateDocument;
    updateDocument.u.update.updateDocumentLength = EXPECTED_DESIRED_JSON_SIZE;

	/* Generate a Shadow desired state document, using a timestamp for the client
	 * token. To keep the client token within 6 characters, it is modded by 1000000. */
	status = snprintf(pUpdateDocument,
	EXPECTED_DESIRED_JSON_SIZE + 1,
	SHADOW_DESIRED_JSON, (int ) desiredState,
			(long unsigned ) (IotClock_GetTimeMs() % 1000000));

	/* Check for errors from snprintf. The expected value is the length of
	 * the desired JSON document less the format specifier for the state. */
	if ((size_t ) status != EXPECTED_DESIRED_JSON_SIZE) {
		IotLogError(
				"Failed to generate desired state document for Shadow update"
						" %d of %d.", i, AWS_IOT_DEMO_SHADOW_UPDATE_COUNT);

		status = EXIT_FAILURE;
		return status;
	} else {
		status = EXIT_SUCCESS;
	}

	IotLogInfo("Sending Shadow update %d of %d: %s", i,
			AWS_IOT_DEMO_SHADOW_UPDATE_COUNT, pUpdateDocument);

	/* Send the Shadow update. Because the Shadow is constantly updated in
	 * this demo, the "Keep Subscriptions" flag is passed to this function.
	 * Note that this flag only needs to be passed on the first call, but
	 * passing it for subsequent calls is fine.
	 */
    updateStatus = AwsIotShadow_TimedUpdate( mqttConnection,
                                             &updateDocument,
                                             AWS_IOT_SHADOW_FLAG_KEEP_SUBSCRIPTIONS,
                                             TIMEOUT_MS );

	/* Check the status of the Shadow update. */
	if (updateStatus != AWS_IOT_SHADOW_SUCCESS) {
		IotLogError("Failed to send Shadow update %d of %d, error %s.", i,
				AWS_IOT_DEMO_SHADOW_UPDATE_COUNT,
				AwsIotShadow_strerror(updateStatus));

		status = EXIT_FAILURE;
		return status;
	} else {
		IotLogInfo("Successfully sent Shadow update %d of %d.", i,
				AWS_IOT_DEMO_SHADOW_UPDATE_COUNT);

		/* Wait for the delta callback to change its state before continuing. */
		if (IotSemaphore_TimedWait(pDeltaSemaphore, TIMEOUT_MS) == false) {
			IotLogError("Timed out waiting on delta callback to change state.");

			status = EXIT_FAILURE;
			return status;
		}
	}

    return status;
}

static void prvNetworkStateChangeCallback( uint32_t ulNetworkType,
                                           AwsIotNetworkState_t xNetworkState,
                                           void * pvContext )
{
    ( void ) pvContext;

    if( xNetworkState == eNetworkStateEnabled )
    {
        /* Release the semaphore, to indicate other tasks that a network is available */
        if( xNetworkConnected == pdFALSE )
        {
            xSemaphoreGive( xNetworkAvailableLock );
        }
    }
    else if( xNetworkState == eNetworkStateDisabled )
    {
        /* If the publish task is already connected to this network, set connected network flag to none,
         * to trigger a reconnect.
         */
        if( ( xNetworkConnected == pdTRUE ) && ( xConnection.ulNetworkType == ulNetworkType ) )
        {
            xNetworkConnected = pdFALSE;
        }
    }
}

static IotNetworkError_t prvNetworkDisconnectCallback( void * pvContext )
{
    ( void ) pvContext;
    xNetworkConnected = pdFALSE;

    return IOT_NETWORK_SUCCESS;
}

static BaseType_t prxCreateNetworkConnection( void )
{
    BaseType_t xRet = pdFALSE;
    uint32_t ulRetriesLeft = DemoCONN_RETRY_LIMIT;
    uint32_t ulRetryIntervalMS = DemoCONN_RETRY_INTERVAL_MS;

    do
    {
        /* No networks are available, block for a physical network connection. */
        if( ( AwsIotNetworkManager_GetConnectedNetworks() & DemoNETWORK_TYPES ) == AWSIOT_NETWORK_TYPE_NONE )
        {
            /* Block for a Network Connection. */
            configPRINTF( ( "Waiting for a network connection.\r\n" ) );
            ( void ) xSemaphoreTake( xNetworkAvailableLock, portMAX_DELAY );
        }

        #if defined( CONFIG_UPDATE_DEMO_ENABLED )
            /* Connect to one of the network type.*/
            xRet = xMqttDemoCreateNetworkConnection( &xConnection, DemoNETWORK_TYPES );
        #endif

        if( xRet == pdTRUE )
        {
            break;
        }
        else
        {
            /* Connection failed. Retry for a configured number of retries. */
            if( ulRetriesLeft > 0 )
            {
                configPRINTF( ( "Network Connection failed, retry delay %lu ms, retries left %lu\r\n", ulRetryIntervalMS, ulRetriesLeft ) );
                vTaskDelay( pdMS_TO_TICKS( ulRetryIntervalMS ) );
            }
        }
    } while( ulRetriesLeft-- > 0 );

    return xRet;
}

static uint32_t prvGenerateSensorJSON( char * Buffer )
{
	char * Buff = Buffer;
	st_sensors_t data;

#if (3 == APP_VERSION_BUILD)
	if (1 == sensorupdatecurrentState)
	{
		R_READ_Sensors(&data);
		data.temperature = (data.temperature - 32) / 1.8;
		return ( uint32_t ) snprintf( Buff,
									  renesasDemoBUFFER_LENGTH,
									  renesasDemoSENSOR_JSON,
									  data.temperature,
									  data.als,
									  data.humidity,
									  data.pressure,
									  data.accel.xacc,
									  data.accel.yacc,
									  data.accel.zacc,
									  data.gyro.xacc,
									  data.gyro.yacc,
									  data.gyro.zacc );
	}
	else
	{
		return ( uint32_t ) snprintf( Buff,
		                              renesasDemoBUFFER_LENGTH,
		                              renesasDemoSENSOR_JSON,
									  0,
									  0,
									  0,
									  0,
									  0,
									  0,
									  0,
									  0,
									  0,
									  0 );
	}
#else
	return ( uint32_t ) snprintf( Buff,
	                              renesasDemoBUFFER_LENGTH,
	                              renesasDemoSENSOR_JSON,
								  0,
								  0,
								  0,
								  0,
								  0,
								  0,
								  0,
								  0,
								  0,
								  0 );
#endif
}

/**
 * @brief Called by the MQTT library when an operation completes.
 *
 * The demo uses this callback to determine the result of PUBLISH operations.
 * @param[in] param1 The number of the PUBLISH that completed, passed as an intptr_t.
 * @param[in] pOperation Information about the completed operation passed by the
 * MQTT library.
 */
static void _operationCompleteCallback( void * param1,
                                        IotMqttCallbackParam_t * const pOperation )
{
    intptr_t publishCount = ( intptr_t ) param1;

