renesas/amazon-freertos/projects/renesas/rx65n-cloud-kit-uart-sx-ulpgn/e2studio-gcc/aws_demos/application_code/renesas_demo_data_uploader.c
    /* Set the members of the subscription list. */
    for( i = 0; i < TOPIC_FILTER_COUNT; i++ )
    {
        pSubscriptions[ i ].qos = IOT_MQTT_QOS_1;
        pSubscriptions[ i ].pTopicFilter = pTopicFilters[ i ];
        pSubscriptions[ i ].topicFilterLength = TOPIC_FILTER_LENGTH;
        pSubscriptions[ i ].callback.pCallbackContext = pCallbackParameter;
        pSubscriptions[ i ].callback.function = _mqttSubscriptionCallback;
    }

    /* Modify subscriptions by either subscribing or unsubscribing. */
    if( operation == IOT_MQTT_SUBSCRIBE )
    {
        subscriptionStatus = IotMqtt_TimedSubscribe( xConnection.xMqttConnection,
                                                     pSubscriptions,
                                                     TOPIC_FILTER_COUNT,
                                                     0,
                                                     MQTT_TIMEOUT_MS );

        /* Check the status of SUBSCRIBE. */
        switch( subscriptionStatus )
        {
            case IOT_MQTT_SUCCESS:
                IotLogInfo( "All demo topic filter subscriptions accepted." );
                break;

            case IOT_MQTT_SERVER_REFUSED:

                /* Check which subscriptions were rejected before exiting the demo. */
                for( i = 0; i < TOPIC_FILTER_COUNT; i++ )
                {
                    if( IotMqtt_IsSubscribed( xConnection.xMqttConnection,
                                              pSubscriptions[ i ].pTopicFilter,
                                              pSubscriptions[ i ].topicFilterLength,
                                              NULL ) == true )
                    {
                        IotLogInfo( "Topic filter %.*s was accepted.",
                                    pSubscriptions[ i ].topicFilterLength,
                                    pSubscriptions[ i ].pTopicFilter );
                    }
                    else
                    {
                        IotLogError( "Topic filter %.*s was rejected.",
                                     pSubscriptions[ i ].topicFilterLength,
                                     pSubscriptions[ i ].pTopicFilter );
                    }
                }

                status = EXIT_FAILURE;
                break;

            default:

                status = EXIT_FAILURE;
                break;
        }
    }
    else if( operation == IOT_MQTT_UNSUBSCRIBE )
    {
        subscriptionStatus = IotMqtt_TimedUnsubscribe( xConnection.xMqttConnection,
                                                       pSubscriptions,
                                                       TOPIC_FILTER_COUNT,
                                                       0,
                                                       MQTT_TIMEOUT_MS );

        /* Check the status of UNSUBSCRIBE. */
        if( subscriptionStatus != IOT_MQTT_SUCCESS )
        {
            status = EXIT_FAILURE;
        }
    }
    else
    {
        /* Only SUBSCRIBE and UNSUBSCRIBE are valid for modifying subscriptions. */
        IotLogError( "MQTT operation %s is not valid for modifying subscriptions.",
                     IotMqtt_OperationType( operation ) );

        status = EXIT_FAILURE;
    }

    return status;
}

/*-----------------------------------------------------------*/

/**
 * @brief Transmit all messages and wait for them to be received on topic filters.
 *
 * @param[in] mqttConnection The MQTT connection to use for publishing.
 * @param[in] pTopicNames Array of topic names for publishing. These were previously
 * subscribed to as topic filters.
 * @param[in] pPublishReceivedCounter Counts the number of messages received on
 * topic filters.
 *
 * @return `EXIT_SUCCESS` if all messages are published and received; `EXIT_FAILURE`
 * otherwise.
 */
static int _publishAllMessages( IotMqttConnection_t mqttConnection,
                                const char ** pTopicNames,
                                IotSemaphore_t * pPublishReceivedCounter,
								const IotNetworkInterface_t * pNetworkInterface,
								void * pNetworkCredentialInfo )
{
    int status = EXIT_SUCCESS;
    intptr_t publishCount = 0, i = 0;
    IotMqttError_t publishStatus = IOT_MQTT_STATUS_PENDING;
    IotMqttPublishInfo_t publishInfo = IOT_MQTT_PUBLISH_INFO_INITIALIZER;
    IotMqttCallbackInfo_t publishComplete = IOT_MQTT_CALLBACK_INFO_INITIALIZER;
    wifi_err_t wifiStatus;

    char cDataBuffer[ renesasDemoBUFFER_LENGTH ] = { 0 };

    IotMqttConnectInfo_t xConnectInfo = IOT_MQTT_CONNECT_INFO_INITIALIZER;

    configPRINTF( ( "SWVersion %u.%u.%u\r\n",
                    xAppFirmwareVersion.u.x.ucMajor,
                    xAppFirmwareVersion.u.x.ucMinor,
                    xAppFirmwareVersion.u.x.usBuild ) );
    configPRINTF( ( "Creating MQTT Client...\r\n" ) );

    /* The MQTT library should invoke this callback when a PUBLISH message
     * is successfully transmitted. */
    publishComplete.function = _operationCompleteCallback;

    /* Set the common members of the publish info. */
    publishInfo.qos = IOT_MQTT_QOS_1;
    publishInfo.topicNameLength = TOPIC_FILTER_LENGTH;
    publishInfo.pPayload = cDataBuffer;
    publishInfo.retryMs = PUBLISH_RETRY_MS;
    publishInfo.retryLimit = PUBLISH_RETRY_LIMIT;

    wifiStatus = R_WIFI_SX_ULPGN_GetIpAddress(&ip_cfg);

    /* Loop to PUBLISH all messages of this demo. */
    while(1)
    {
        configPRINTF( ( "Connected to broker.\r\n" ) );
		while (1)
		{
			/* Wait forever traffic but allow other tasks to run and output statistics only once per second. */
			vTaskDelay( myappONE_SECOND_DELAY_IN_TICKS);

			/* Sensor data upload */
			/* Pass the PUBLISH number to the operation complete callback. */
			publishComplete.pCallbackContext = (void*) publishCount;

			/* Choose a topic name (round-robin through the array of topic names). */
			publishInfo.pTopicName = pTopicNames[publishCount
					% TOPIC_FILTER_COUNT];

			/* Generate the payload for the PUBLISH. */
			prvGenerateSensorJSON(cDataBuffer);
			turn_on_led();

			/* Check for errors from snprintf. */
			if (status < 0) {
				IotLogError(
						"Failed to generate MQTT PUBLISH payload for PUBLISH %d.",
						(int ) publishCount);
				status = EXIT_FAILURE;

				break;
			} else {
				publishInfo.payloadLength = (uint32_t ) strlen(cDataBuffer);
				status = EXIT_SUCCESS;
			}

			/* PUBLISH a message. This is an asynchronous function that notifies of
			 * completion through a callback. */
			publishStatus = IotMqtt_Publish(xConnection.xMqttConnection,
					&publishInfo, 0, &publishComplete,
					NULL);
			if (publishStatus != IOT_MQTT_STATUS_PENDING) {
				IotLogError("MQTT PUBLISH %d returned error %s.",
						(int ) publishCount, IotMqtt_strerror(publishStatus));
				status = EXIT_FAILURE;

				break;
			}

			/* PUBLISH SWVersion & IPAddress */
		    publishStatus = mpttAckCallBack();
			if (publishStatus != IOT_MQTT_STATUS_PENDING) {
				IotLogError("MQTT PUBLISH %d returned error %s.",
							(int ) publishCount, IotMqtt_strerror(publishStatus));
				status = EXIT_FAILURE;
			}

			/* If a complete burst of messages has been published, wait for an equal
			 * number of messages to be received. Note that messages may be received
			 * out-of-order, especially if a message was lost and had to be retried. */
			if ((publishCount % IOT_DEMO_MQTT_PUBLISH_BURST_SIZE)
					== ( IOT_DEMO_MQTT_PUBLISH_BURST_SIZE - 1)) {
				IotLogInfo("Waiting for %d publishes to be received.",
						IOT_DEMO_MQTT_PUBLISH_BURST_SIZE);

				for (i = 0; i < IOT_DEMO_MQTT_PUBLISH_BURST_SIZE; i++) {
					if (IotSemaphore_TimedWait(pPublishReceivedCounter,
					MQTT_TIMEOUT_MS) == false) {
						IotLogError(
								"Timed out waiting for incoming PUBLISH messages.");
						status = EXIT_FAILURE;
						break;
					}
				}

				IotLogInfo("%d publishes received.", i);
			}

			/* Stop publishing if there was an error. */
			if (status == EXIT_FAILURE) {
				break;
			}

			publishCount++;
		}
		IotMqtt_Disconnect(xConnection.xMqttConnection, false);
#if defined( CONFIG_UPDATE_DEMO_ENABLED )
		vMqttDemoDeleteNetworkConnection(&xConnection);
#endif
		/* After failure to connect or a disconnect, wait an arbitrary one second before retry. */
		vTaskDelay( myappONE_SECOND_DELAY_IN_TICKS);

		if (status == EXIT_FAILURE)
		{
			break;
		}
	}
	return status;
}

/*-----------------------------------------------------------*/

/**
 * @brief The function that runs the MQTT demo, called by the demo runner.
 *
 * @param[in] awsIotMqttMode Specify if this demo is running with the AWS IoT
 * MQTT server. Set this to `false` if using another MQTT server.
 * @param[in] pIdentifier NULL-terminated MQTT client identifier.
 * @param[in] pNetworkServerInfo Passed to the MQTT connect function when
 * establishing the MQTT connection.
 * @param[in] pNetworkCredentialInfo Passed to the MQTT connect function when
 * establishing the MQTT connection.
 * @param[in] pNetworkInterface The network interface to use for this demo.
 *
 * @return `EXIT_SUCCESS` if the demo completes successfully; `EXIT_FAILURE` otherwise.
 */
int RenesasSensorDataUploadDemo( bool awsIotMqttMode,
                 const char * pIdentifier,
                 void * pNetworkServerInfo,
                 void * pNetworkCredentialInfo,
                 const IotNetworkInterface_t * pNetworkInterface )
{
    /* Return value of this function and the exit status of this program. */
    int status = EXIT_SUCCESS;

    /* Handle of the MQTT connection used in this demo. */
    IotMqttConnection_t mqttConnection = IOT_MQTT_CONNECTION_INITIALIZER;

    /* Counts the number of incoming PUBLISHES received (and allows the demo
     * application to wait on incoming PUBLISH messages). */
    IotSemaphore_t publishesReceived;

    /* Allows the Shadow update function to wait for the delta callback to complete
     * a state change before continuing. */
    IotSemaphore_t deltaSemaphore;

    /* Length of Shadow Thing Name. */
    size_t thingNameLength = 0;

    /* Topics used as both topic filters and topic names in this demo. */
    const char * pTopics[ TOPIC_FILTER_COUNT ] =
    {
        IOT_DEMO_MQTT_TOPIC_PREFIX "/topic/sensor",
    };

    /* Flags for tracking which cleanup functions must be called. */
    bool librariesInitialized = false, connectionEstablished = false, deltaSemaphoreCreated = false;

