renesas/amazon-freertos/projects/renesas/rx65n-cloud-kit-uart-sx-ulpgn/e2studio-gcc/aws_demos/application_code/renesas_demo_data_uploader.c
    xNetworkAvailableLock = xSemaphoreCreateBinary();
    if( xNetworkAvailableLock == NULL )
    {
        configPRINTF( ( "Failed to create semaphore.\r\n" ) );
        return EXIT_FAILURE;
    }

    /* for sensor API */
    configPRINTF( ( "Sensor API Initialized\r\n" ) );
    R_INIT_Sensors();

    /* Initialize the libraries required for this demo. */
    status = _initializeDemo();

    if( AwsIotNetworkManager_SubscribeForStateChange( DemoNETWORK_TYPES,
                                                      prvNetworkStateChangeCallback,
                                                      NULL,
                                                      &xSubscriptionHandle ) != pdTRUE )
    {
        configPRINTF( ( "Failed to create Network Manager subscription.\r\n" ) );
        return EXIT_FAILURE;
    }

    if( status == EXIT_SUCCESS )
    {
        /* Mark the libraries as initialized. */
        librariesInitialized = true;

        /* Establish a new MQTT connection. */
        status = _establishMqttConnection( awsIotMqttMode,
                                           pIdentifier,
                                           pNetworkServerInfo,
                                           pNetworkCredentialInfo,
                                           pNetworkInterface,
										   &( xConnection.xMqttConnection ) );
    }

    if( status == EXIT_SUCCESS )
    {
        /* Mark the MQTT connection as established. */
        connectionEstablished = true;

        /* Add the topic filter subscriptions used in this demo. */
        status = _modifySubscriptions( ( xConnection.xMqttConnection ),
                                       IOT_MQTT_SUBSCRIBE,
                                       pTopics,
                                       &publishesReceived );
    }

    /* for processing */
    if( DemoNETWORK_TYPES == AWSIOT_NETWORK_TYPE_NONE )
    {
        configPRINTF( ( "There are no networks configured for the demo.\r\n" ) );
        return EXIT_FAILURE;
    }

    /* for Device shadow */
    /* Create the semaphore that synchronizes with the delta callback. */
    /* Determine the length of the Thing Name. */
    if( pIdentifier != NULL )
    {
        thingNameLength = strlen( pIdentifier );

        if( thingNameLength == 0 )
        {
            IotLogError( "The length of the Thing Name (identifier) must be nonzero." );

            status = EXIT_FAILURE;
        }
    }
    else
    {
        IotLogError( "A Thing Name (identifier) must be provided for the Shadow demo." );

        status = EXIT_FAILURE;
    }

    deltaSemaphoreCreated = IotSemaphore_Create( &deltaSemaphore, 0, 1 );
    if( deltaSemaphoreCreated == false )
    {
        status = EXIT_FAILURE;
    }

    if( status == EXIT_SUCCESS )
    {
        /* Set the Shadow callbacks for this demo. */
        status = _setShadowCallbacks( &deltaSemaphore,
        							  ( xConnection.xMqttConnection ),
                                      pIdentifier,
                                      thingNameLength );
    }

    if( status == EXIT_SUCCESS )
    {
        /* Clear the Shadow document so that this demo starts with no existing
         * Shadow. */
        _clearShadowDocument( ( xConnection.xMqttConnection ), pIdentifier, thingNameLength );

        /* Send Shadow updates. */
        status = _sendShadowUpdates( &deltaSemaphore,
        							 ( xConnection.xMqttConnection ),
                                     pIdentifier,
                                     thingNameLength );

        /* Create the semaphore to count incoming PUBLISH messages. */
        if( IotSemaphore_Create( &publishesReceived,
                                 0,
                                 IOT_DEMO_MQTT_PUBLISH_BURST_SIZE ) == true )
        {
            /* PUBLISH (and wait) for all messages. */
            status = _publishAllMessages( ( xConnection.xMqttConnection ),
                                          pTopics,
                                          &publishesReceived,
										  pNetworkInterface,
										  pNetworkCredentialInfo );

            /* Destroy the incoming PUBLISH counter. */
            IotSemaphore_Destroy( &publishesReceived );
            IotSemaphore_Destroy( &deltaSemaphore );
        }
        else
        {
            /* Failed to create incoming PUBLISH counter. */
            status = EXIT_FAILURE;
        }
    }

    /* Clean up libraries if they were initialized. */
    if( librariesInitialized == true )
    {
        _cleanupDemo();
    }

    return status;
}

/*-----------------------------------------------------------*/
